# <center> 4. spark code challenge - solution </center>

Data Srouce: [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle

In [1]:
import findspark
import os

In [2]:
findspark.init(os.environ['SPARK_HOME'])

In [3]:
from pyspark.sql import SparkSession
import pyspark.sql.functions as F

In [4]:
import pandas as pd

In [5]:
# create spark session
spark = SparkSession.builder.appName('salaries').getOrCreate()

1. read csv file

In [6]:
df_spk = spark.read.csv('./data/salaries.csv', header=True, sep=',', inferSchema=True)

In [7]:
df_pd = pd.read_csv('./data/salaries.csv')

2. take a look at the dataframe

In [10]:
df_spk.show(5)

+---+-----------------+--------------------+---------+-----------+---------+--------+---------+----------------+----+-----+-------------+------+
| Id|     EmployeeName|            JobTitle|  BasePay|OvertimePay| OtherPay|Benefits| TotalPay|TotalPayBenefits|Year|Notes|       Agency|Status|
+---+-----------------+--------------------+---------+-----------+---------+--------+---------+----------------+----+-----+-------------+------+
|  1|   NATHANIEL FORD|GENERAL MANAGER-M...|167411.18|        0.0|400184.25|    null|567595.43|       567595.43|2011| null|San Francisco|  null|
|  2|     GARY JIMENEZ|CAPTAIN III (POLI...|155966.02|  245131.88|137811.38|    null|538909.28|       538909.28|2011| null|San Francisco|  null|
|  3|   ALBERT PARDINI|CAPTAIN III (POLI...|212739.13|  106088.18|  16452.6|    null|335279.91|       335279.91|2011| null|San Francisco|  null|
|  4|CHRISTOPHER CHONG|WIRE ROPE CABLE M...|  77916.0|   56120.71| 198306.9|    null|332343.61|       332343.61|2011| null|San Francisco|  null|
|  5|  PATRICK GARDNER|DEPUTY CHIEF OF D...| 134401.6|     9737.0|182234.59|    null|326373.19|       326373.19|2011| null|San Francisco|  null|
+---+-----------------+--------------------+---------+-----------+---------+--------+---------+----------------+----+-----+-------------+------+
only showing top 5 rows

In [9]:
df_pd.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

3. check schema of the dataframe

In [11]:
df_spk.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- EmployeeName: string (nullable = true)
 |-- JobTitle: string (nullable = true)
 |-- BasePay: double (nullable = true)
 |-- OvertimePay: double (nullable = true)
 |-- OtherPay: double (nullable = true)
 |-- Benefits: double (nullable = true)
 |-- TotalPay: double (nullable = true)
 |-- TotalPayBenefits: double (nullable = true)
 |-- Year: integer (nullable = true)
 |-- Notes: string (nullable = true)
 |-- Agency: string (nullable = true)
 |-- Status: double (nullable = true)

#### pandas df.info()

In [13]:
df_pd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

4. how many records in the dataframe

In [14]:
df_spk.count()

148654

In [15]:
len(df_pd)

148654

In [16]:
df_pd.shape

(148654, 13)

5. What is the average BasePay

In [20]:
df_spk.agg(F.avg(F.col('BasePay'))).show()

+-----------------+
|     avg(BasePay)|
+-----------------+
|66325.44884049208|
+-----------------+

In [19]:
df_pd['BasePay'].mean()

66325.4488404877

6. What is the job title of JOSEPH DRISCOLL

In [24]:
df_spk.where("EmployeeName = 'JOSEPH DRISCOLL'").select('JobTitle').collect()[0][0]

'CAPTAIN, FIRE SUPPRESSION'

In [37]:
df_pd[df_pd['EmployeeName'] == 'JOSEPH DRISCOLL'][['JobTitle']].iloc[0, 0]

'CAPTAIN, FIRE SUPPRESSION'

7. How much does JOSEPH DRISCOLL make (including benefits)

In [38]:
df_spk.where("EmployeeName = 'JOSEPH DRISCOLL'").select('TotalPayBenefits').collect()[0][0]

270324.91

In [39]:
df_pd[df_pd['EmployeeName'] == 'JOSEPH DRISCOLL'][['TotalPayBenefits']].iloc[0, 0]

270324.91

8. What is the name of highest paid person (including benefits)?

In [44]:
df_spk.sort(F.desc('TotalPayBenefits')).collect()[0].EmployeeName

'NATHANIEL FORD'

In [58]:
df_pd.sort_values('TotalPayBenefits', ascending=False).iloc[0]['EmployeeName']

'NATHANIEL FORD'

9. What is the name of lowest paid person (including benefits)

In [59]:
df_spk.sort('TotalPayBenefits').collect()[0].EmployeeName

'Joe Lopez'

In [62]:
df_pd.sort_values('TotalPayBenefits', ascending=True).iloc[0]['EmployeeName']

'Joe Lopez'

10. What was the average (mean) BasePay of all employees per year?

In [66]:
df_spk.groupBy('Year').agg(F.avg(F.col('BasePay')).alias('AvgBasePay')) \
      .sort('Year').show()

+----+------------------+
|Year|        AvgBasePay|
+----+------------------+
|2011|63595.956516774524|
|2012| 65436.40685742133|
|2013| 69630.03021647697|
|2014| 66564.42192449843|
+----+------------------+

In [70]:
df_pd[['Year', 'BasePay']].groupby('Year').mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

11. How many unique job titles are there?

In [71]:
df_spk.select('JobTitle').dropDuplicates().count()

2159

In [72]:
df_pd['JobTitle'].nunique()

2159

11. What are the top 5 most common jobs

In [75]:
df_spk.groupBy('JobTitle').count().sort(F.desc('count')).show(5, truncate=False)

+----------------------------+-----+
|JobTitle                    |count|
+----------------------------+-----+
|Transit Operator            |7036 |
|Special Nurse               |4389 |
|Registered Nurse            |3736 |
|Public Svc Aide-Public Works|2518 |
|Police Officer 3            |2421 |
+----------------------------+-----+
only showing top 5 rows

#### pandas df.col.value_counts()

In [82]:
df_pd['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

13. How many Job Titles were represented by only one person in 2013?

In [84]:
df_spk.where("Year = 2013").groupBy('JobTitle').count().filter(F.col('count') == 1).count()

202

In [93]:
series = df_pd[df_pd['Year'] == 2013]['JobTitle'].value_counts()
len(series[series == 1])

202

14. How many people have the word Chief or chief in their job title?

In [94]:
df_spk.where("LOWER(JobTitle) LIKE '%chief%'").count()

627

In [100]:
len(df_pd[df_pd['JobTitle'].str.lower().str.contains('chief')])

627